
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [3]:
import pandas as pd
data= (4, 8, 15, 16, 23, 42)

In [4]:
data

(4, 8, 15, 16, 23, 42)

In [6]:
ds=pd.DataFrame(data)

In [7]:
ds

    0
0   4
1   8
2  15
3  16
4  23
5  42

In [8]:
ds.dtypes

0    int64
dtype: object

In [9]:
type(ds.dtypes)

pandas.core.series.Series

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the 
variable print it.

In [10]:
data1=[1,2,3,4,5,6,8,9,7,0]

In [11]:
data1

[1, 2, 3, 4, 5, 6, 8, 9, 7, 0]

In [60]:
ds1=pd.DataFrame(data1)

In [62]:
ds1.dtypes

0    int64
dtype: object

In [63]:
type(ds1.dtypes)

pandas.core.series.Series

Q.3 Create a Pandas DataFrame that contains the following data:

In [21]:
data3={"name":["alice","bob","claire"],
       "Age":["25","30","27"],
       "Gender":["Female","Male","Femal"]}

In [22]:
data3

{'name': ['alice', 'bob', 'claire'],
 'Age': ['25', '30', '27'],
 'Gender': ['Female', 'Male', 'Femal']}

In [24]:
df=pd.DataFrame(data3)

In [26]:
df

     name Age  Gender
0   alice  25  Female
1     bob  30    Male
2  claire  27   Femal

Q4.What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

DataFrame is the function of pandas library and it is arrange the data set in the frame with index as per data arrangement.in pandas series you have take a single line of data perform like particular column or row witch is end with single[] bracketes or list.but DataFrame apply all the data set.

In [34]:
#examples.
data ={"a":[3,4,5,4],
      "b":[3,4,5,6],
      "c":[3,4,5,6],
      "d":["raju","mina","rahul","kunal"]}

In [36]:
df1=pd.DataFrame(data)

In [42]:
df2=df1[['a']]

In [43]:
df2

   a
0  3
1  4
2  5
3  4

In [44]:
df2.dtypes

a    int64
dtype: object

In [45]:
type(df2.dtypes)

pandas.core.series.Series

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can 
you give an example of when you might use one of these functions?

there are some common function that use to manipulate data in pandas DataFrame are following:-
1.categorical
2.iloc
3.loc
4.head()
5.dtype()

In [46]:
#examples
data ={"a":[3,4,5,4],
      "b":[3,4,5,6],
      "c":[3,4,5,6],
      "d":["raju","mina","rahul","kunal"]}

In [48]:
df=pd.DataFrame(data)

In [49]:
df.head(2)

   a  b  c     d
0  3  3  3  raju
1  4  4  4  mina

In [50]:
df.columns

Index(['a', 'b', 'c', 'd'], dtype='object')

In [51]:
df.tail(2)

   a  b  c      d
2  5  5  5  rahul
3  4  6  6  kunal

Q6.Which of the following is mutable in nature Series, DataFrame, Panel?

Mostly function of DataFrame are futable in nature like nuberical value and list can be mutable when it is series formate when it is single list then it have to first change in to series then we make it mutable.

Q7.Create a DataFrame using multiple Series. Explain with an example.

In [52]:
import pandas as pd

In [53]:
df=pd.read_csv("excel-sheelt.csv")

In [54]:
df

,,,,,,,,,,,,,,,,,,,,,,,,,,,,sep=,Unnamed: 1
Circle,Sitetype,Network Type,Alarming OpCo,Site Name,Site ID,Alarm Name,Alarm Text,Start Time,OSS Time,Event Time,Work Log,Area,Tech No,Fse Mobile,Config ID,Toc Site Priority,Alarm Identifier,PM Flag,Outage cause,Outage info,OME Partner,Tech Name,Fse Name,Tech Manager,Techn Manager No,Anchor Opco,Telecom Vendor,TT Details,Logic Id
Rest of West Bengal,Non-Strategic,4G,Airtel,BCF_62_Balarampur_ARTL_4G,IN-1256117,Low Battery Voltage,LOW DC,2022-11-15 12:23:27,2022-11-15 12:23:22,2022-11-15 12:23:22,NaN,Malda & Dinajpur,9609001103,8945556151,MRBTS-65795,10.NORMAL SITE,6957117,PM-OFF,NaN,NaN,NIPL,Sahajan Ali,Others - 869769 Titan Mallik,Niladri Karmakar,9051619116,Vodafone,NSN-eNodeB,NaN,NSN_AIRTEL_KOL_ROWB_DUO4_10_131_29_137_MRBTS-6...
Kolkata,Non-Strategic,4G,Airtel,Bangabasi_College_ZTE_4G,IN-1073048,Low Battery Voltage,LOW BATTERY VOLTAGE,2022-11-15 12:22:43,2022-11-15 12:22:27,2022-11-15 12:22:27,CNT_TOC_EAST_D_NK_ESC_TECH_ack,Kolkata -1,9007023025,9933499072,rns1012_KO_E_F_OM_BBCL,10.NORMAL SITE,1099441,PM-ON,NaN,NaN,Technocon,Sankar Saha,Others - 865507 Anup Mondal,Kallol Mishra,9163399755,Airtel,ZTE-eNodeB,NaN,ZTE_AIRTEL_KOL_ROWB_DUO02_10_193_97_229_rns101...

In [55]:
df.columns

Index(['sep=', 'Unnamed: 1'], dtype='object')

In [56]:
df.head()

,,,,,,,,,,,,,,,,,,,,,,,,,,,,sep=,Unnamed: 1
Circle,Sitetype,Network Type,Alarming OpCo,Site Name,Site ID,Alarm Name,Alarm Text,Start Time,OSS Time,Event Time,Work Log,Area,Tech No,Fse Mobile,Config ID,Toc Site Priority,Alarm Identifier,PM Flag,Outage cause,Outage info,OME Partner,Tech Name,Fse Name,Tech Manager,Techn Manager No,Anchor Opco,Telecom Vendor,TT Details,Logic Id
Rest of West Bengal,Non-Strategic,4G,Airtel,BCF_62_Balarampur_ARTL_4G,IN-1256117,Low Battery Voltage,LOW DC,2022-11-15 12:23:27,2022-11-15 12:23:22,2022-11-15 12:23:22,NaN,Malda & Dinajpur,9609001103,8945556151,MRBTS-65795,10.NORMAL SITE,6957117,PM-OFF,NaN,NaN,NIPL,Sahajan Ali,Others - 869769 Titan Mallik,Niladri Karmakar,9051619116,Vodafone,NSN-eNodeB,NaN,NSN_AIRTEL_KOL_ROWB_DUO4_10_131_29_137_MRBTS-6...
Kolkata,Non-Strategic,4G,Airtel,Bangabasi_College_ZTE_4G,IN-1073048,Low Battery Voltage,LOW BATTERY VOLTAGE,2022-11-15 12:22:43,2022-11-15 12:22:27,2022-11-15 12:22:27,CNT_TOC_EAST_D_NK_ESC_TECH_ack,Kolkata -1,9007023025,9933499072,rns1012_KO_E_F_OM_BBCL,10.NORMAL SITE,1099441,PM-ON,NaN,NaN,Technocon,Sankar Saha,Others - 865507 Anup Mondal,Kallol Mishra,9163399755,Airtel,ZTE-eNodeB,NaN,ZTE_AIRTEL_KOL_ROWB_DUO02_10_193_97_229_rns101...

In [58]:
df.dtypes

sep=          object
Unnamed: 1    object
dtype: object

In [59]:
type(df.dtypes)

pandas.core.series.Series